mikaelpatel/Cosa-LowPowerLab/boards.txt
# @file boards.txt
# @version 1.0
#
# @section License
# Copyright (C) 2014-2015, Mikael Patel
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
# Lesser General Public License for more details.
#
# @section Description
# The Cosa LowPowerLab boards definition file.
#
# This file is part of the Arduino Che Cosa project.

##
# LOWPOWERLABS BOARDS
##

# AVR:ATmega328
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 258 CK/14 CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (512 words, 0x3e00).
moteino.name=Cosa LowPowerLab Moteino (ATmega328/DualOptiboot)
moteino.upload.tool=avrdude
moteino.upload.protocol=arduino
moteino.upload.maximum_size=31744
moteino.upload.maximum_data_size=2048
moteino.upload.maximum_eeprom_size=1024
moteino.upload.speed=115200

moteino.bootloader.tool=avrdude
moteino.bootloader.low_fuses=0xde
moteino.bootloader.high_fuses=0xdc
moteino.bootloader.extended_fuses=0xfd

moteino.build.mcu=atmega328p
moteino.build.f_cpu=16000000L
moteino.build.board=LOWPOWERLAB_MOTEINO
moteino.build.variant=lowpowerlab/moteino
moteino.build.core=Cosa:cosa

# AVR:ATmega1284
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (512 words, 0xfe00).
moteino-mega.name=Cosa LowPowerLab Moteino Mega (ATmega1284P/DualOptiboot)
moteino-mega.upload.tool=avrdude
moteino-mega.upload.protocol=arduino
moteino-mega.upload.maximum_size=130048
moteino-mega.upload.maximum_data_size=16384
moteino-mega.upload.maximum_eeprom_size=4096
moteino-mega.upload.speed=115200

moteino-mega.bootloader.tool=avrdude
moteino-mega.bootloader.low_fuses=0xde
moteino-mega.bootloader.high_fuses=0xde
moteino-mega.bootloader.extended_fuses=0xfd

moteino-mega.build.mcu=atmega1284p
moteino-mega.build.f_cpu=16000000L
moteino-mega.build.board=LOWPOWERLAB_MOTEINO_MEGA
moteino-mega.build.variant=lowpowerlab/moteino-mega
moteino-mega.build.core=Cosa:cosa
